Network Working Group                                   Fatai Zhang, Ed. 
Internet Draft                                                    Huawei 
Category: Standards Track                                  Guoying Zhang 
                                                                    CATR 
                                                          Sergio Belotti 
                                                          Alcatel-Lucent 
                                                           D. Ceccarelli 
                                                                Ericsson 
                                                        Khuzema Pithewan 
                                                                Infinera 
Expires: September 9, 2012                                 March 9, 2012 
                                    
                                    
      Generalized Multi-Protocol Label Switching (GMPLS) Signaling 
  Extensions for the evolving G.709 Optical Transport Networks Control 
                                    
                                    
              draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt 


Status of this Memo 

   This Internet-Draft is submitted to IETF in full conformance with   
   the provisions of BCP 78 and BCP 79. 

   Internet-Drafts are working documents of the Internet Engineering   
   Task Force (IETF), its areas, and its working groups.  Note that   
   other groups may also distribute working documents as Internet-   
   Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six months   
   and may be updated, replaced, or obsoleted by other documents at any   
   time.  It is inappropriate to use Internet-Drafts as reference   
   material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at   
   http://www.ietf.org/ietf/1id-abstracts.txt. 

   The list of Internet-Draft Shadow Directories can be accessed at   
   http://www.ietf.org/shadow.html. 

   This Internet-Draft will expire on September 9, 2012. 

    

Abstract 
 
   Recent progress in ITU-T Recommendation G.709 standardization has 
   introduced new ODU containers (ODU0, ODU4, ODU2e and ODUflex) and 

 
 
Zhang                  Expires September 2012                 [Page 1] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   enhanced Optical Transport Networking (OTN) flexibility. Several 
   recent documents have proposed ways to modify GMPLS signaling 
   protocols to support these new OTN features.  

   It is important that a single solution is developed for use in GMPLS 
   signaling and routing protocols. This solution must support ODUk 
   multiplexing capabilities, address all of the new features, be 
   acceptable to all equipment vendors, and be extensible considering 
   continued OTN evolution.  

   This document describes the extensions to the Generalized Multi-
   Protocol Label Switching (GMPLS) signaling to control the evolving 
   Optical Transport Networks (OTN) addressing ODUk multiplexing and new 
   features including ODU0, ODU4, ODU2e and ODUflex. 

    

Conventions used in this document 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in [RFC2119]. 

    

Table of Contents 

   1. Introduction .................................................. 3 
   2. Terminology ................................................... 4 
   3. GMPLS Extensions for the Evolving G.709 - Overview ............ 4 
   4. Generalized Label Request ..................................... 5 
   5. Extensions for Traffic Parameters for the Evolving G.709 ...... 5 
      5.1. Usage of ODUflex(CBR) Traffic Parameters ................. 7 
      5.2. Usage of ODUflex(GFP) Traffic Parameters ................. 9 
   6. Generalized Label ............................................. 9 
      6.1. New definition of ODU Generalized Label ................. 10 
      6.2. Examples ................................................ 12 
      6.3. Label Distribution Procedure ............................ 14 
         6.3.1. Notification on Label Error ........................ 15 
      6.4. Supporting Virtual Concatenation and Multiplication ..... 15 
   7. Supporting Multiplexing Hierarchy ............................ 16 
      7.1. ADAPTATION Object ....................................... 17 
      7.2. ODU FA-LSP Creation ..................................... 19 
   8. Supporting Hitless Adjustment of ODUflex (GFP) ............... 20 
   9. Control Plane Backward Compatibility Considerations........... 21 
   10. Security Considerations ..................................... 22 
   11. IANA Considerations.......................................... 22 
 
 
Zhang                  Expires September 2012                 [Page 2] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   12. References .................................................. 23 
      12.1. Normative References ................................... 23 
      12.2. Informative References ................................. 24 
   13. Contributors ................................................ 25 
   14. Authors' Addresses .......................................... 25 
   15. Acknowledgment .............................................. 28 
 
1. Introduction 

   Generalized Multi-Protocol Label Switching (GMPLS) [RFC3945] extends 
   MPLS to include Layer-2 Switching (L2SC), Time-Division Multiplex 
   (e.g., SONET/SDH, PDH, and ODU), Wavelength (OCh, Lambdas) Switching, 
   and Spatial Switching (e.g., incoming port or fiber to outgoing port 
   or fiber). [RFC3471] presents a functional description of the 
   extensions to Multi-Protocol Label Switching (MPLS) signaling 
   required to support Generalized MPLS.  RSVP-TE-specific formats and 
   mechanisms and technology specific details are defined in [RFC3473]. 

   With the evolution and deployment of G.709 technology, it is 
   necessary that appropriate enhanced control technology support be 
   provided for G.709. [RFC4328] describes the control technology 
   details that are specific to foundation G.709 Optical Transport 
   Networks (OTN), as specified in the ITU-T Recommendation G.709 [G709-
   V1], for ODUk deployments without multiplexing. 

   In addition to increasing need to support ODUk multiplexing, the 
   evolution of OTN has introduced additional containers and new 
   flexibility. For example, ODU0, ODU2e, ODU4 containers and ODUflex 
   are developed in [G709-V3]. 

   In addition, the following issues require consideration: 

      -  Support for Hitless Adjustment of ODUflex (GFP) (HAO), which is 
         defined in [G.7044]. 

      -  Support for Tributary Port Number. The Tributary Port Number 
         has to be negotiated on each link for flexible assignment of 
         tributary ports to tributary slots in case of LO-ODU over HO-
         ODU (e.g., ODU2 into ODU3).  

   Therefore, it is clear that [RFC4328] has to be updated or superceded 
   in order to support ODUk multiplexing, as well as other ODU 
   enhancements introduced by evolution of OTN standards.  

   This document updates [RFC4328] extending the G.709 ODUk traffic 
   parameters and also presents a new OTN label format which is very 
   flexible and scalable. 
 
 
Zhang                  Expires September 2012                 [Page 3] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


2. Terminology 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",   
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this   
   document are to be interpreted as described in [RFC2119]. 

3. GMPLS Extensions for the Evolving G.709 - Overview 

   New features for the evolving OTN, for example, new ODU0, ODU2e, ODU4 
   and ODUflex containers are specified in [G709-V3]. The corresponding 
   new signal types are summarized below: 

      - Optical Channel Transport Unit (OTUk): 
         . OTU4 

      - Optical Channel Data Unit (ODUk): 
         . ODU0 
         . ODU2e 
         . ODU4 
         . ODUflex 

   A new Tributary Slot (TS) granularity (i.e., 1.25 Gbps) is also 
   described in [G709-V3]. Thus, there are now two TS granularities for 
   the foundation OTN ODU1, ODU2 and ODU3 containers. The TS granularity 
   at 2.5 Gbps is used on legacy interfaces while the new 1.25 Gbps is 
   used on the new interfaces. 

   In addition to the support of ODUk mapping into OTUk (k = 1, 2, 3, 4), 
   the evolving OTN [G.709-V3] encompasses the multiplexing of ODUj (j = 
   0, 1, 2, 2e, 3, flex) into an ODUk (k > j), as described in Section 
   3.1.2 of [OTN-FWK]. 

   Virtual Concatenation (VCAT) of OPUk (OPUk-Xv, k = 1/2/3, X = 1...256) 
   is also supported by [OTN-V3]. Note that VCAT of OPU0 / OPU2e / OPU4 
   / OPUflex is not supported per [OTN-V3]. 

   [RFC4328] describes GMPLS signaling extensions to support the control 
   for G.709 Optical Transport Networks (OTN) [G709-V1]. However, 
   [RFC4328] needs to be updated because it does not provide the means 
   to signal all the new signal types and related mapping and 
   multiplexing functionalities. Moreover, it supports only the 
   deprecated auto-MSI mode which assumes that the Tributary Port Number 
   is automatically assigned in the transmit direction and not checked 
   in the receive direction. 

   This document extends the G.709 traffic parameters described in 
   [RFC4328] and presents a new flexible and scalable OTN label format. 
 
 
Zhang                  Expires September 2012                 [Page 4] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   Additionally, procedures about Tributary Port Number assignment 
   through control plane are also provided in this document. 

4. Generalized Label Request  

   The Generalized Label Request, as described in [RFC3471], carries the 
   LSP Encoding Type, the Switching Type and the Generalized Protocol 
   Identifier (G-PID).  

   [RFC4328] extends the Generalized Label Request, introducing two new 
   code-points for the LSP Encoding Type (i.e., G.709 ODUk (Digital Path) 
   and G.709 Optical Channel) and adding a list of G-PID values in order 
   to accommodate [G709-v1]. 

   This document follows these extensions and a new Switching Type is 
   introduced to indicate the ODUk switching capability [G709-V3] in 
   order to support backward compatibility with [RFC4328], as described 
   in [OTN-FWK]. The new Switching Type (101, TBA by IANA) is defined in 
   [OTN-OSPF]. 

    

5. Extensions for Traffic Parameters for the Evolving G.709 

   The traffic parameters for G.709 are defined as follows: 

      0                   1                   2                   3 
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |  Signal Type  |   Reserved    |           NMC/ Tolerance      | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |              NVC              |        Multiplier (MT)        | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |                            Bit_Rate                           | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   The Signal Type needs to be extended in order to cover the new Signal 
   Type introduced by the evolving OTN. The new Signal Type values are 
   extended as follows: 

      Value    Type 
      -----    ---- 
      0        Not significant 
      1        ODU1 (i.e., 2.5 Gbps) 
      2        ODU2 (i.e., 10 Gbps) 
      3        ODU3 (i.e., 40 Gbps) 
 
 
Zhang                  Expires September 2012                 [Page 5] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


      4        ODU4 (i.e., 100 Gbps) 
      5        Reserved (for future use) 
      6        OCh at 2.5 Gbps 
      7        OCh at 10 Gbps 
      8        OCh at 40 Gbps 
      9        OCh at 100 Gbps 
      10       ODU0 (i.e., 1.25 Gbps) 
      11       ODU2e (i.e., 10Gbps for FC1200 and GE LAN) 
      12~19    Reserved (for future use) 
      20       ODUflex(CBR) (i.e., 1.25*N Gbps) 
      21       ODUflex(GFP-F), resizable (i.e., 1.25*N Gbps) 
      22       ODUflex(GFP-F), non resizable (i.e., 1.25*N Gbps) 
      23~255   Reserved (for future use) 
    
   NMC/Tolerance:  

   This field is redefined from the original definition in [RFC4328]. 
   NMC field defined in [RFC4328] cannot be fixed value for an end-to-
   end circuit involving dissimilar OTN link types. For example, ODU2e 
   requires 9 TS on ODU3 and 8 TS on ODU4. Usage of NMC field is 
   deprecated and should be used only with [RFC4328] generalized label 
   format for backwards compatibility reasons. For the new generalized 
   label format as defined in this document this field is interpreted as 
   Tolerance. 

   In case of ODUflex(CBR), the Bit_Rate and Tolerance fields MUST be 
   used together to represent the actual bandwidth of ODUflex, where: 

   -  The Bit_Rate field indicates the nominal bit rate of ODUflex(CBR) 
      expressed in bytes per second, encoded as a 32-bit IEEE single-
      precision floating-point number (referring to [RFC4506] and 
      [IEEE]). The value contained in the Bit Rate field has to keep 
      into account both 239/238 factor and the Transcoding factor. 

   -  The Tolerance field indicates the bit rate tolerance (part per 
      million, ppm) of the ODUflex(CBR) encoded as an unsigned integer, 
      which is bounded in 0~100ppm. 

   For example, for an ODUflex(CBR) service with Bit_Rate = 2.5Gbps and 
   Tolerance = 100ppm, the actual bandwidth of the ODUflex is: 

                         2.5Gbps * (1 +/- 100ppm) 

   In case of ODUflex(GFP), the Bit_Rate field is used to indicate the 
   nominal bit rate of the ODUflex(GFP), which implies the number of 
 
 
Zhang                  Expires September 2012                 [Page 6] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   tributary slots requested for the ODUflex(GFP). Since the tolerance 
   of ODUflex(GFP) makes no sense on tributary slot resource reservation, 
   the Tolerance field for ODUflex(GFP) is not necessary and MUST be 
   filled with 0. 

   In case of other ODUk signal types, the Bit_Rate and Tolerance fields 
   are not necessary and MUST be set to 0. 

   The usage of the NVC and Multiplier (MT) fields are the same as 
   [RFC4328]. 

5.1. Usage of ODUflex(CBR) Traffic Parameters 

   In case of ODUflex(CBR), the information of Bit_Rate and Tolerance in 
   the ODUflex traffic parameters MUST be used to determine the total 
   number of tributary slots N in the HO ODUk link to be reserved. Here:  

         N = Ceiling of 

   ODUflex(CBR) nominal bit rate * (1 + ODUflex(CBR) bit rate tolerance) 
   --------------------------------------------------------------------- 
       ODTUk.ts nominal bit rate * (1 - HO OPUk bit rate tolerance) 

   In this formula, the ODUflex(CBR) nominal bit rate is the bit rate of 
   the ODUflex(CBR) on the line side, i.e., the client signal bit rate 
   after applying the 239/238 factor (according to clause 7.3 table 7.2 
   of [G709-V3]) and the transcoding factor T (if needed) on the CBR 
   client. According to clauses 17.7.3, 17.7.4 and 17.7.5 of [G709-V3]: 

   ODUflex(CBR) nominal bit rate = CBR client bit rate * (239/238) / T 

   The ODTUk.ts nominal bit rate is the nominal bit rate of the 
   tributary slot of ODUk, as shown in Table 1 (referring to [G709-V3]). 

              Table 1 - Actual TS bit rate of ODUk (in Gbps) 

      ODUk.ts       Minimum          Nominal          Maximum 
      ---------------------------------------------------------- 
      ODU2.ts    1.249 384 632    1.249 409 620    1.249 434 608 
      ODU3.ts    1.254 678 635    1.254 703 729    1.254 728 823 
      ODU4.ts    1.301 683 217    1.301 709 251    1.301 735 285 

      Note that: 

      Minimum bit rate of ODUTk.ts =  
         ODTUk.ts nominal bit rate * (1 - HO OPUk bit rate tolerance) 

 
 
Zhang                  Expires September 2012                 [Page 7] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


    
      Maximum bit rate of ODTUk.ts =  
         ODTUk.ts nominal bit rate * (1 + HO OPUk bit rate tolerance) 

      Where: HO OPUk bit rate tolerance = 20ppm 

   Therefore, a node receiving a PATH message containing ODUflex(CBR)  
   nominal bit rate and tolerance can allocate precise number of 
   tributary slots and set up the cross-connection for the ODUflex 
   service.  

   Note that for different ODUk, the bit rates of the tributary slots 
   are different, and so the total number of tributary slots to be 
   reserved for the ODUflex(CBR) may not be the same on different HO 
   ODUk links. 

   An example is given below to illustrate the usage of ODUflex(CBR) 
   traffic parameters. 

   As shown in Figure 1, assume there is an ODUflex(CBR) service 
   requesting a bandwidth of (2.5Gbps, +/-100ppm) from node A to node C. 
   In other words, the ODUflex traffic parameters indicate that Signal 
   Type is 20 (ODUflex(CBR)), Bit_Rate is 2.5Gbps and Tolerance is 
   100ppm. 

     +-----+             +---------+             +-----+ 
     |     +-------------+ +-----+ +-------------+     | 
     |     +=============+\| ODU |/+=============+     | 
     |     +=============+/| flex+-+=============+     | 
     |     +-------------+ |     |\+=============+     | 
     |     +-------------+ +-----+ +-------------+     | 
     |     |             |         |             |     | 
     |     |   .......   |         |   .......   |     | 
     |  A  +-------------+    B    +-------------+  C  | 
     +-----+   HO ODU4   +---------+   HO ODU2   +-----+ 
    
       =========: TS occupied by ODUflex 
       ---------: free TS 

           Figure 1 - Example of ODUflex(CBR) Traffic Parameters 

    

   -  On the HO ODU4 link between node A and B: 

      The maximum bit rate of the ODUflex(CBR) equals 2.5Gbps * (1 + 
      100ppm), and the minimum bit rate of the tributary slot of ODU4 
 
 
Zhang                  Expires September 2012                 [Page 8] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


      equals 1.301 683 217Gbps, so the total number of tributary slots 
      N1 to be reserved on this link is: 

      N1 = ceiling (2.5Gbps * (1 + 100ppm) / 1.301 683 217Gbps) = 2 

   -  On the HO ODU2 link between node B and C: 

      The maximum bit rate of the ODUflex equals 2.5Gbps * (1 + 100ppm), 
      and the minimum bit rate of the tributary slot of ODU2 equals 
      1.249 384 632Gbps, so the total number of tributary slots N2 to 
      be reserved on this link is: 

      N2 = ceiling (2.5Gbps * (1 + 100ppm) / 1.249 384 632Gbps) = 3 

    

5.2. Usage of ODUflex(GFP) Traffic Parameters 

   [G709-V3-A2] recommends that the ODUflex(GFP) will fill an integral 
   number of tributary slots of the smallest HO ODUk path over which the 
   ODUflex(GFP) may be carried, as shown in Table 2.  

         Table 2 - Recommended ODUflex(GFP) bit rates and tolerance 

              ODU type             | Nominal bit-rate | Tolerance 
   --------------------------------+------------------+----------- 
   ODUflex(GFP) of n TS, 1<=n<=8   |   n * ODU2.ts    | +/-100 ppm 
   ODUflex(GFP) of n TS, 9<=n<=32  |   n * ODU3.ts    | +/-100 ppm 
   ODUflex(GFP) of n TS, 33<=n<=80 |   n * ODU4.ts    | +/-100 ppm 

   According to this table, the Bit_Rate field for ODUflex(GFP) MUST 
   equal to one of the 80 values listed below: 

       1 * ODU2.ts; 2 * ODU2.ts; ...; 8 * ODU2.ts; 
       9 * ODU3.ts; 10 * ODU3.ts, ...; 32 * ODU3.ts; 
       33 * ODU4.ts; 34 * ODU4.ts; ...; 80 * ODU4.ts. 

   In this way, the number of required tributary slots for the 
   ODUflex(GFP) (i.e., the value of "n" in Table 2) can be deduced from 
   the Bit_Rate field. 

    

6. Generalized Label 

   [RFC3471] has defined the Generalized Label which extends the 
   traditional label by allowing the representation of not only labels 
 
 
Zhang                  Expires September 2012                 [Page 9] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   which are sent in-band with associated data packets, but also labels 
   which identify time-slots, wavelengths, or space division multiplexed 
   positions. The format of the corresponding RSVP-TE Generalized Label   
   object is defined in the Section 2.3 of [RFC3473]. 

   However, for different technologies, we usually need use specific 
   label rather than the Generalized Label. For example, the label 
   format described in [RFC4606] could be used for SDH/SONET, the label 
   format in [RFC4328] for G.709.   

    

6.1. New definition of ODU Generalized Label 

   In order to be compatible with new types of ODU signal and new types 
   of tributary slot, the following new ODU label format MUST be used: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |         TPN           |   Reserved    |        Length         | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   ~             Bit Map         .........                         ~ 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The ODU Generalized Label is used to indicate how the LO ODUj signal 
   is multiplexed into the HO ODUk link. Note that the LO OUDj signal 
   type is indicated by traffic parameters, while the type of HO ODUk 
   link can be figured out locally according to the identifier of the 
   selected interface carried in the IF_ID RSVP_HOP Object. 

   TPN (12 bits): indicates the Tributary Port Number (TPN) for the 
   assigned Tributary Slot(s).  

      -  In case of LO ODUj multiplexed into HO ODU1/ODU2/ODU3, only the 
         lower 6 bits of TPN field are significant and the other bits of 
         TPN MUST be set to 0. 

      -  In case of LO ODUj multiplexed into HO ODU4, only the lower 7 
         bits of TPN field are significant and the other bits of TPN 
         MUST be set to 0.  

      -  In case of ODUj mapped into OTUk (j=k), the TPN is not needed 
         and this field MUST be set to 0. 

   As per [G709-V3], The TPN is used to allow for correct demultiplexing 
   in the data plane. When an LO ODUj is multiplexed into HO ODUk 
 
 
Zhang                  Expires September 2012                [Page 10] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   occupying one or more TSs, a new TPN value is configured at the two 
   ends of the HO ODUk link and is put into the related MSI byte(s) in 
   the OPUk overhead at the (traffic) ingress end of the link, so that 
   the other end of the link can learn which TS(s) is/are used by the LO 
   ODUj in the data plane. 

   According to [G709-V3], the TPN field MUST be set as according to the 
   following tables: 

                                      
          Table 3 - TPN Assignment Rules (2.5Gbps TS granularity) 
   +-------+-------+----+----------------------------------------------+ 
   |HO ODUk|LO ODUj|TPN |          TPN Assignment Rules                | 
   +-------+-------+----+----------------------------------------------+ 
   | ODU2  | ODU1  |1~4 |Fixed, = TS# occupied by ODU1                 | 
   +-------+-------+----+----------------------------------------------+ 
   |       | ODU1  |1~16|Fixed, = TS# occupied by ODU1                 | 
   | ODU3  +-------+----+----------------------------------------------+ 
   |       | ODU2  |1~4 |Flexible, != other existing LO ODU2s' TPNs    | 
   +-------+-------+----+----------------------------------------------+ 

                                      
                                      
          Table 4 - TPN Assignment Rules (1.25Gbps TS granularity) 
   +-------+-------+----+----------------------------------------------+ 
   |HO ODUk|LO ODUj|TPN |          TPN Assignment Rules                | 
   +-------+-------+----+----------------------------------------------+ 
   | ODU1  | ODU0  |1~2 |Fixed, = TS# occupied by ODU0                 | 
   +-------+-------+----+----------------------------------------------+ 
   |       | ODU1  |1~4 |Flexible, != other existing LO ODU1s' TPNs    | 
   | ODU2  +-------+----+----------------------------------------------+ 
   |       |ODU0 & |1~8 |Flexible, != other existing LO ODU0s and      | 
   |       |ODUflex|    |ODUflexes' TPNs                               | 
   +-------+-------+----+----------------------------------------------+ 
   |       | ODU1  |1~16|Flexible, != other existing LO ODU1s' TPNs    | 
   |       +-------+----+----------------------------------------------+ 
   |       | ODU2  |1~4 |Flexible, != other existing LO ODU2s' TPNs    | 
   | ODU3  +-------+----+----------------------------------------------+ 
   |       |ODU0 & |    |Flexible, != other existing LO ODU0s and      | 
   |       |ODU2e &|1~32|ODU2es and ODUflexes' TPNs                    | 
   |       |ODUflex|    |                                              | 
   +-------+-------+----+----------------------------------------------+ 
   | ODU4  |Any ODU|1~80|Flexible, != ANY other existing LO ODUs' TPNs | 
   +-------+-------+----+----------------------------------------------+ 

   Note that in the case of "Flexible", the value of TPN is not 
   corresponding to the TS number as per [G709-V3].  
 
 
Zhang                  Expires September 2012                [Page 11] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   Length (12 bits): indicates the number of bit of the Bit Map field, 
   i.e., the total number of TS in the HO ODUk link.  

   In case of an ODUk mapped into OTUk, there is no need to indicate 
   which tributary slots will be used, so the length field MUST be set 
   to 0. 

   Bit Map (variable): indicates which tributary slots in HO ODUk that 
   the LO ODUj will be multiplexed into. The sequence of the Bit Map is 
   consistent with the sequence of the tributary slots in HO ODUk. Each 
   bit in the bit map represents the corresponding tributary slot in HO 
   ODUk with a value of 1 or 0 indicating whether the tributary slot 
   will be used by LO ODUj or not. 

   Padded bits are added behind the Bit Map to make the whole label a 
   multiple of four bytes if necessary. Padded bit MUST be set to 0 and 
   MUST be ignored. 

   Note that the Length field in the label format can also be used to 
   indicate the TS type of the HO ODUk (i.e., TS granularity at 1.25Gbps 
   or 2.5Gbps) since the HO ODUk type can be known from IF_ID RSVP_HOP 
   Object. In some cases when there is no LMP (Link Management Protocol) 
   or routing to make the two end points of the link to know the TSG, 
   the TSG information used by another end can be deduced from the label 
   format. For example, for HO ODU2 link, the value of the length filed 
   will be 4 or 8, which indicates the TS granularity is 2.5Gbps or 
   1.25Gbps, respectively. 

6.2. Examples  

   The following examples are given in order to illustrate the label 
   format described in the previous sections of this document. 

   (1) ODUk into OTUk mapping:  

   In such conditions, the downstream node along an LSP returns a label 
   indicating that the ODUk (k=1, 2, 3, 4) is directly mapped into the 
   corresponding OTUk. The following example label indicates an ODU1 
   mapped into OTU1. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |       TPN = 0         |   Reserved    |     Length = 0        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   (2) ODUj into ODUk multiplexing:  
 
 
Zhang                  Expires September 2012                [Page 12] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   In such conditions, this label indicates that an ODUj is multiplexed 
   into several tributary slots of OPUk and then mapped into OTUk. Some 
   instances are shown as follow: 

   -  ODU0 into ODU2 Multiplexing: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |       TPN = 2         |   Reserved    |     Length = 8        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |0 1 0 0 0 0 0 0|             Padded Bits (0)                   | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   This above label indicates an ODU0 multiplexed into the second 
   tributary slot of ODU2, wherein there are 8 TS in ODU2 (i.e., the 
   type of the tributary slot is 1.25Gbps), and the TPN value is 2. 

   -  ODU1 into ODU2 Multiplexing with 1.25Gbps TS granularity: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |       TPN = 1         |   Reserved    |     Length = 8        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |0 1 0 1 0 0 0 0|             Padded Bits (0)                   | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   This above label indicates an ODU1 multiplexed into the 2nd and the 
   4th tributary slot of ODU2, wherein there are 8 TS in ODU2 (i.e., the 
   type of the tributary slot is 1.25Gbps), and the TPN value is 1. 

   -  ODU2 into ODU3 Multiplexing with 2.5Gbps TS granularity: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |       TPN = 1         |   Reserved    |     Length = 16       | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |0 1 1 0 1 0 1 0 0 0 0 0 0 0 0 0|       Padded Bits (0)         | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   This above label indicates an ODU2 multiplexed into the 2nd, 3rd, 5th 
   and 7th tributary slot of ODU3, wherein there are 16 TS in ODU3 (i.e., 
   the type of the tributary slot is 2.5Gbps), and the TPN value is 1. 


 
 
Zhang                  Expires September 2012                [Page 13] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


6.3. Label Distribution Procedure 

   This document does not change the existing label distribution 
   procedures [RFC4328] for GMPLS except that the new ODUk label MUST be 
   processed as follows. 

   When a node receives a generalized label request for setting up an 
   ODUj LSP from its upstream neighbor node, the node MUST generate an 
   ODU label according to the signal type of the requested LSP and the 
   free resources (i.e., free tributary slots of ODUk) that will be 
   reserved for the LSP, and send the label to its upstream neighbor 
   node.  

   In case of ODUj to ODUk multiplexing, the node MUST firstly determine 
   the size of the Bit Map field according to the signal type and the 
   tributary slot type of ODUk, and then set the bits to 1 in the Bit 
   Map field corresponding to the reserved tributary slots. The node 
   MUST also assign a valid TPN, which does not collide with other TPN 
   value used by existing LO ODU connections in the selected HO ODU link, 
   and configure the expected multiplex structure identifier (ExMSI) 
   using this TPN. Then, the assigned TPN is filled into the label. 

   In case of ODUk to OTUk mapping, the node only needs to fill the ODUj 
   and the ODUk fields with corresponding values in the label. Other 
   bits are reserved and MUST be set to 0. 

   In order to process a received ODU label, the node MUST firstly learn 
   which ODU signal type is multiplexed or mapped into which ODU signal 
   type accordingly to the traffic parameters and the IF_ID RSVP_HOP 
   Object in the received message.  

   In case of ODUj to ODUk multiplexing, the node MUST retrieve the 
   reserved tributary slots in the ODUk by its downstream neighbor node 
   according to the position of the bits that are set to 1 in the Bit 
   Map field. The node determines the TS type (according to the total TS 
   number of the ODUk, or pre-configured TS type), so that the node, 
   based on the TS type, can multiplex the ODUj into the ODUk. The node 
   MUST also retrieve the TPN value assigned by its downstream neighbor 
   node from the label, and fill the TPN into the related MSI byte(s) in 
   the OPUk overhead in the data plane, so that the downstream neighbor 
   node can check whether the TPN received from the data plane is 
   consistent with the ExMSI and determine whether there is any mismatch 
   defect. 

   In case of ODUk to OTUk mapping, the size of Bit Map field MUST be 0 
   and no additional procedure is needed. 

 
 
Zhang                  Expires September 2012                [Page 14] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   Note that the procedures of other label related objects (e.g., 
   Upstream Label, Label Set) are similar to the one described above. 

   Note also that the TPN in the label_ERO MAY not be assigned (i.e., 
   TPN field = 0) if the TPN is requested to be assigned locally.  

6.3.1. Notification on Label Error 

   When receiving an ODUk label from the neighbor node, the node SHOULD 
   check the integrity of the label. An error message containing an 
   "Unacceptable label value" indication ([RFC3209]) SHOULD be sent if 
   one of the following cases occurs: 

   -  Invalid value in the length field. 

   -  The selected link only supports 2.5Gbps TS granularity while the 
      Length field in the label along with ODUk signal type indicates 
      the 1.25Gbps TS granularity; 

   -  The label includes an invalid TPN value that breaks the TPN 
      assignment rules; 

   -  The reserved resources (i.e., the number of "1" in the Bit Map 
      field) do not match with the Traffic Parameters. 

6.4. Supporting Virtual Concatenation and Multiplication 

   As per [RFC6344], the VCGs can be created using Co-Signaled style or 
   Multiple LSPs style. 

   In case of Co-Signaled style, the explicit ordered list of all labels 
   reflects the order of VCG members, which is similar to [RFC4328]. In 
   case of multiplexed virtually concatenated signals (NVC > 1), the 
   first label indicates the components of the first virtually 
   concatenated signal; the second label indicates the components of the 
   second virtually concatenated signal; and so on. In case of 
   multiplication of multiplexed virtually concatenated signals (MT > 1), 
   the first label indicates the components of the first multiplexed 
   virtually concatenated signal; the second label indicates components 
   of the second multiplexed virtually concatenated signal; and so on. 

   In case of Multiple LSPs style, multiple control plane LSPs are 
   created with a single VCG and the VCAT Call can be used to associate 
   the control plane LSPs. The procedures are similar to section 6 of 
   [RFC6344]. 

    
 
 
Zhang                  Expires September 2012                [Page 15] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


7. Supporting Multiplexing Hierarchy  

   As described in [OTN-FWK], one ODUj connection can be nested into 
   another ODUk (j<k) connection, which forms the multiplexing hierarchy 
   in the ODU layer. This is useful if there are some intermediate nodes 
   in the network which only support ODUk but not ODUj switching. 

   For example, in Figure 2, assume that N3 is a legacy node which only 
   supports [G709-V1] and does not support ODU0 switching. If an ODU0 
   connection between N1 and N5 is required, then we can create an ODU2 
   connection between N2 and N4 (or ODU1 / ODU3 connection, depending on 
   policies and the capabilities of the two ends of the connection), and 
   nest the ODU0 into the ODU2 connection. In this way, N3 only needs to 
   perform ODU2 switching and does not need to be aware of the ODU0 
   connection.  

      |                                                          | 
      |<------------------- ODU0 Connection -------------------->| 
      |              |                            |              | 
      |              |<---- ODU2 Connection ----->|              | 
      |              |                            |              | 
   +----+         +----+         +----+         +----+         +----+ 
   | N1 +---------+ N2 +=========+ N3 +=========+ N4 +---------+ N5 | 
   +----+         +----+         +----+         +----+         +----+ 
         ODU3 link      ODU3 link      ODU3 link      ODU3 link 

               Figure 2 - Example of multiplexing hierarchy 

   The control plane signaling should support the provisioning of 
   hierarchical multiplexing. Two methods are provided below (taking 
   Figure 2 as example): 

   -  Using the multi-layer network signaling described in [RFC4206], 
      [RFC6107] and [RFC6001] (including related modifications, if 
      needed). That is, when the signaling message for ODUO connection 
      arrives at N2, a new RSVP session between N2 and N4 is triggered 
      to create the ODU2 connection. This ODU2 connection is treated as 
      a Forwarding Adjacency (FA) after it is created. And then the 
      signaling procedure for the ODU0 connection can be continued using 
      the resource of the ODU2 FA. 

   -  The ODU2 FA-LSP is created in advance based on network planning, 
      which is treated as an FA. Then the ODU0 connection can be created 
      using the resource of the ODU2 FA. In this case, the ODU2 FA-LSP 
      and inner ODU0 connections are created separately. 


 
 
Zhang                  Expires September 2012                [Page 16] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   For both methods, when creating an FA-LSP(e.g., ODU2 FA-LSP), the 
   penultimate hop needs to choose a correct outgoing interface for the 
   ODU2 connection, so that the destination node can support 
   multiplexing and de-multiplexing LO ODU signal(e.g., ODU0). In order 
   to choose a correct outgoing interface for the penultimate hop of the 
   FA-LSP, multiplexing capability (i.e., what client signal type that 
   can be adapted directly to this FA-LSP) should be carried in the 
   signaling to setup this FA-LSP. In addition, when Auto_Negotiation in 
   the data plane is not enabled, TS granularity may also be needed. 

7.1. ADAPTATION Object 

   In order to create ODU FA-LSP (i.e., the server layer LSP) for 
   carrying the client LSP, a new object called ADAPTATION Object is 
   introduced, with two TLVs defined in this document: 

     - Type 1 = Server TSG signaling 

     - Type 2 = Hierarchy signaling 

   (1) Type=1 - Server TSG TLV 

      0                   1                   2                   3 
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |        Type = 1 (TSG)         |           Length              | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |     TSG       |                  Reserved                     | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   TSG: Tributary Slot Granularity (8bit): Used for signaling the server 
   layer TSG: 

            - 0 - Reserved 
            - 1 - either 1.25Gbps or 2.5Gbps 
            - 2 - 2.5Gbps 
            - 3 - 1.25Gbps 
            - 4~255 - Reserved 

   Where value 1 is used where the fallback procedure at the source end 
   of FA is enabled and the default value of 1.25Gbps can be fallen back 
   to 2.5Gbps. This means that either 1.25 Gpbs or 2.5 Gbps can be used 
   as the server TSG at the sink end of FA. 

   Values 2 and 3 are used to signal a 2.5Gbps or 1.25Gbps interfaces 
   respectively and there is no chance to modify it. 

 
 
Zhang                  Expires September 2012                [Page 17] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   Other values are reserved for future extension. 

   (2) Type=2 - Hierarchy TLV 

      0                   1                   2                   3 
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |    Type = 2 (Hierarchy)       |           Length              | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     | LSP Enc. Type |Switching Type |  Signal Type  |   Mapping     | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |                                                               | 
     |                              ...                              | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     | LSP Enc. Type |Switching Type |  Signal Type  |   Mapping     | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   A Hierarchy TLV for each branch of the client signal multiplexing 
   supported by the server LSP MUST be used. Inside each TLV a row for 
   each stage of the hierarchy MUST be included. 

   A row for the server stage MUST NOT be included as it is already 
   signaled via the Traffic Parameters. 

   The number of stages is implicitly inferred from the length value. 

   The meaning of the fields is defined as follow: 

      LSP Encoding Type and Switching Type: These fields can assume any 
      value inherited from the Generalized Label Request Object in GMPLS 
      signaling, defined in [RFC3471] and following related RFCs and 
      drafts.  

      Signal Type: In the case of non OTN signal types, this field MUST 
      be set to 0, while in the case of OTN signal types if MUST be 
      filled accordingly to [RFC4328] and this document. 

      Mapping: This field indicates the mapping function used in each 
      client-server relationship of the hierarchy. The values of this 
      field are listed below: 

           Value          Type 
           -----         ------ 
             0            Reserved 
             1            AMP 
             2            BMP 
             3            GMP 
 
 
Zhang                  Expires September 2012                [Page 18] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


             4            GFP-F 
             5            GFP-T 
           6-255          Reserved 

   For example, in order to create ODU3 FA-LSP passing through a set of 
   ODU4 links to perform ODU1->ODU2->ODU3 hierarchy, the Hierarchy TLV 
   can be used to indicate the ODU2 into ODU3 multiplexing and ODU1 into 
   ODU2 multiplexing stages. 

     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |    Type = 2 (Hierarchy)       |         Length = 8            | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     | Enc.=12(ODUk) | Switching=101 |  Sig. = ODU2  | Mapping = AMP | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     | Enc.=12(ODUk) | Switching=101 |  Sig. = ODU1  | Mapping = AMP | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

    
7.2. ODU FA-LSP Creation 

   When creating an ODU FA-LSP, the source node (e.g., node N2 in Figure 
   2) can include the ADAPTATION object to specify the desired hierarchy 
   capabilities. 

   On receiving the Path message, the penultimate node on the FA-LSP 
   (e.g., node N3 in Figure 2) MUST select an outgoing link which has 
   the ability to carry the requested ODU FA-LSP which can support the 
   TS granularity and the multiplexing hierarchy listed in the 
   ADAPTATION object at the remote end of the link (Note that such 
   remote capability information can be obtained through LMP, routing 
   protocol or configuration). Then the penultimate node uses the IF_ID 
   RSVP_HOP Object to indicate the selected link for carrying the FA-LSP, 
   as described in [RFC3473]. If no link supporting the specified 
   hierarchy capabilities, a ParhErr message with Error Code = 38 (LSP 
   Hierarchy Issue) and Error Value = y1(new value) MUST be sent back to 
   upstream. 

   Other intermediate nodes along the FA-LSP don't need to process the 
   ADAPTATION object, just forwarding it to the next node in the Path 
   message, without any modification. 

    





 
 
Zhang                  Expires September 2012                [Page 19] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


8. Supporting Hitless Adjustment of ODUflex (GFP) 

   [G.7044] describes the procedure of ODUflex (GFP) hitless resizing 
   using LCR (Link Connection Resize) and BWR (Bandwidth Resize) 
   protocols in OTN data plane. 

   For the control plane, signaling messages are required to initiate 
   the adjustment procedure. Section 2.5 and Section 4.6.4 of [RFC3209] 
   describe how the Share Explicit (SE) style is used in TE network for 
   bandwidth increasing and decreasing, which is still applicable for 
   triggering the ODUflex (GFP) adjustment procedure in data plane.  

   Note that the SE style SHOULD be used at the beginning when creating 
   a resizable ODUflex connection (Signal Type = 21). Otherwise an error 
   with Error Code "Conflicting reservation style" will be generated 
   when performing bandwidth adjustment. 

   If any node along the ODUflex connection doesn't support hitless 
   resizing, a Notify message with Error Code = x2 and Error Value = y1 
   will be sent to the source node. The source node MAY keep the 
   connection and treat it as a non resizable ODUflex connection, or MAY 
   tear it down, depending on the local policy. 

   -  Bandwidth increasing 

       In order to increase the bandwidth of an ODUflex (GFP) connection, 
       a Path message with SE style (keeping Tunnel ID unchanged and 
       assigning a new LSP ID) is sent along the path. 

       A downstream node compares the old Traffic Parameters (stored 
       locally) with the new one carried in the Path message, to 
       determine the number of TS to be added. After choosing and 
       reserving new free TS, the downstream node sends back a Resv 
       message carrying both the old and new LABEL Objects in the SE 
       flow descriptor, so that its upstream neighbor can determine 
       which TS are added. And the LCR protocol between each pair of 
       neighbor nodes is triggered. 

       On the source node, the BWR protocol will be triggered by the 
       successful completion of LCR protocols on every hop after Resv 
       message is processed. On success of BWR, the source node SHOULD 
       send a PathTear message to delete the old control state (i.e., 
       the control state of the ODUflex (GFP) before resizing) on the 
       control plane. 

   -  Bandwidth decreasing 

 
 
Zhang                  Expires September 2012                [Page 20] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


       The SE style can also be used for ODUflex bandwidth decreasing. 
       For each pair of neighbor nodes, the sending and receiving Resv 
       message with old and new LABEL Objects will trigger the first 
       step of LCR between them to perform LCR handshake. On the source 
       node, the BWR protocol will be triggered by the successful 
       completion of LCR handshake on every hop after Resv message is 
       processed. On success of BWR, the second step of LCR, i.e., link 
       connection decrease procedure will be started on every hop of the 
       connection. 

       Similarly, after completion of bandwidth decreasing, a ResvErr 
       message SHOULD be sent to tear down the old control state. 

9. Control Plane Backward Compatibility Considerations 

   Since the [RFC4328] has been deployed in the network for the nodes 
   that support [G709-V1], control plane backward compatibility SHOULD 
   be taken into consideration when the new nodes (supporting [G709-V3] 
   and RSVP-TE extensions defined in this document) and the legacy nodes 
   (supporting [G709-V1] and [RFC4328]) are interworking. 

   The backward compatibility needs to be considered only when 
   controlling ODU1 or ODU2 or ODU3 connection, because legacy nodes can 
   only support these three ODU signal types. In such case, new nodes 
   can fall back to use signaling message defined in [RFC4328] when 
   detecting legacy node on the path. More detailedly: 

   o  When receiving Path message using [RFC4328] (i.e., Switching Type 
      = 100), a new node SHOULD follow [RFC4328] to process and reply it. 

   o  A source node of an ODU LSP can send Path message using new OTN 
      control message (with new Switching Type = 101, TBA by IANA). If 
      there is legacy node on the LSP, it will fail to process the 
      Generalized Label Request Object because of unknown of the new 
      Switching Type, and reply a PathErr message indicating unknown of 
      this object. The source node MAY re-signal the Path message using 
      [RFC4328], depending on local policies. 

   o  Alternatively, if a new node has known that its neighbor only 
      supports [RFC4328] in advance (e.g., through manual configuration 
      or auto discovery mechanism), the new node MAY act as an RSVP 
      agent to translate new RSVP-TE message into old one before sending 
      to its neighbor. 

   No special compatibility consideration needs to be taken if the 
   legacy device has updated its control plane to support this document. 

 
 
Zhang                  Expires September 2012                [Page 21] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


10. Security Considerations 

   This document introduces no new security considerations to the 
   existing GMPLS signaling protocols. Referring to [RFC3473], further 
   details of the specific security measures are provided. Additionally, 
   [GMPLS-SEC] provides an overview of security vulnerabilities and 
   protection mechanisms for the GMPLS control plane. 

    

11. IANA Considerations 

   -  G.709 SENDER_TSPEC and FLOWSPEC objects: 

       The traffic parameters, which are carried in the G.709 
       SENDER_TSPEC and FLOWSPEC objects, do not require any new object 
       class and type based on [RFC4328]: 

       o G.709 SENDER_TSPEC Object: Class = 12, C-Type = 5 [RFC4328] 

       o G.709 FLOWSPEC Object: Class = 9, C-Type = 5 [RFC4328] 

   -  Generalized Label Object: 

       The new defined ODU label (Section 6) is a kind of generalized 
       label. Therefore, the Class-Num and C-Type of the ODU label is 
       the same as that of generalized label described in [RFC3473], 
       i.e., Class-Num = 16, C-Type = 2. 

   -  ADAPTATION Object: 

       New object with Class-Num = xx, C-Type = xx. See Section 7 for 
       the detail definition. 

   -  Error Code = 38 (LSP Hierarchy Issue, referring to [RFC6107]): 

       A new Error Value is added to the Error Code "LSP Hierarchy 
       Issue": 

       Error Value     Error case 
       -------------------------------------------------------------- 
           y1          Last hop of an ODU FA-LSP doesn't support 
                      specified adaption capabilities (Section 7.2). 

   -  Error Code = x2: 


 
 
Zhang                  Expires September 2012                [Page 22] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


       New Error Code, indicating errors occurring when controlling a 
       resizable ODUflex connection. 

       Error Value     Error case 
       -------------------------------------------------------------- 
           y1          Do not support hitless assignment of ODUflex (GFP) 
                      (Section 8). 

    

12. References 

12.1. Normative References 

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate 
             Requirement Levels", BCP 14, RFC 2119, March 1997. 

   [RFC4328] D. Papadimitriou, Ed. "Generalized Multi-Protocol Label 
             Switching (GMPLS) Signaling Extensions for G.709 Optical 
             Transport Networks Control", RFC 4328, Jan 2006. 

   [RFC3209] D. Awduche et al, "RSVP-TE: Extensions to RSVP for LSP 
             Tunnels", RFC3209, December 2001. 

   [RFC3471] Berger, L., Editor, "Generalized Multi-Protocol Label 
             Switching (GMPLS) Signaling Functional Description", RFC 
             3471, January 2003. 

   [RFC3473] L. Berger, Ed., "Generalized Multi-Protocol Label Switching 
             (GMPLS) Signaling Resource ReserVation Protocol-Traffic 
             Engineering (RSVP-TE) Extensions", RFC 3473, January 2003. 

   [RFC3945] Mannie, E., "Generalized Multi-Protocol Label Switching 
             (GMPLS) Architecture", RFC 3945, October 2004. 

   [RFC6344] G. Bernstein et al, "Operating Virtual Concatenation (VCAT) 
             and the Link Capacity Adjustment Scheme (LCAS) with 
             Generalized Multi-Protocol Label Switching (GMPLS)", 
             RFC6344, August 2011. 

   [RFC4206] K. Kompella, Y. Rekhter, Ed., " Label Switched Paths (LSP) 
             Hierarchy with Generalized Multi-Protocol Label Switching 
             (GMPLS) Traffic Engineering (TE)", RFC 4206, October 2005. 

   [RFC6107] K. Shiomoto, A. Farrel, "Procedures for Dynamically 
             Signaled Hierarchical Label Switched Paths", RFC6107, 
             February 2011. 
 
 
Zhang                  Expires September 2012                [Page 23] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   [RFC6001] Dimitri Papadimitriou et al, "Generalized Multi-Protocol 
             Label Switching (GMPLS) Protocol Extensions for Multi-Layer 
             and Multi-Region Networks (MLN/MRN)", RFC6001, February 21, 
             2010. 

   [OTN-FWK] Fatai Zhang et al, "Framework for GMPLS and PCE Control of 
             G.709 Optical Transport Networks", draft-ietf-ccamp-gmpls-
             g709-framework-05.txt, September 9, 2011. 

   [OTN-INFO] S. Belotti et al, "Information model for G.709 Optical 
             Transport Networks (OTN)", draft-ietf-ccamp-otn-g709-info-
             model-01.txt, September 21, 2011. 

   [OTN-OSPF] D. Ceccarelli et al, "Traffic Engineering Extensions to           
             OSPF for Generalized MPLS (GMPLS) Control of Evolving G.709        
             OTN Networks", draft-ietf-ccamp-gmpls-ospf-g709v3-00.txt,          
             October 13, 2011 

   [OTN-LMP] Fatai Zhang, Ed., "Link Management Protocol (LMP) 
             extensions for G.709 Optical Transport Networks", draft-
             zhang-ccamp-gmpls-g.709-lmp-discovery-04.txt, April 6, 2011. 

   [G709-V3] ITU-T, "Interfaces for the Optical Transport Network (OTN) 
             ", G.709/Y.1331, December 2009. 

   [G709-V3-A2] ITU-T, "Interfaces for the Optical Transport Network 
             (OTN) Amendment 2", G.709/y.1331 Amendment 2, April 2011. 

12.2. Informative References 

   [G709-V1] ITU-T, "Interface for the Optical Transport Network (OTN)," 
             G.709 Recommendation (and Amendment 1), February 2001 
             (November 2001). 

   [G709-V2] ITU-T, "Interface for the Optical Transport Network (OTN)," 
             G.709 Recommendation, March 2003. 

   [G798-V2] ITU-T, "Characteristics of optical transport network 
             hierarchy equipment functional blocks", G.798, December 
             2006. 

   [G798-V3] ITU-T, "Characteristics of optical transport network 
             hierarchy equipment functional blocks", G.798v3, consented 
             June 2010. 

   [G.7044]  ITU-T, "Hitless adjustment of ODUflex", G.7044 (and 
             Amendment 1), February 2012. 
 
 
Zhang                  Expires September 2012                [Page 24] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   [RFC4506] M. Eisler, Ed., "XDR: External Data Representation 
             Standard", RFC 4506, May 2006. 

   [IEEE]    "IEEE Standard for Binary Floating-Point Arithmetic", 
             ANSI/IEEE Standard 754-1985, Institute of Electrical and 
             Electronics Engineers, August 1985. 

   [GMPLS-SEC] Fang, L., Ed., "Security Framework for MPLS and GMPLS 
             Networks", Work in Progress, October 2009. 

 
 
13. Contributors 

   Jonathan Sadler, Tellabs
   Email: jonathan.sadler@tellabs.com


   Kam LAM, Alcatel-Lucent
   Email: kam.lam@alcatel-lucent.com


   Xiaobing Zi, Huawei Technologies
   Email: zixiaobing@huawei.com


   Francesco Fondelli, Ericsson
   Email: francesco.fondelli@ericsson.com

   Lyndon Ong, Ciena
   Email: lyong@ciena.com

   Biao Lu, infinera
   Email: blu@infinera.com



14. Authors' Addresses 

   Fatai Zhang (editor)
   Huawei Technologies
   F3-5-B R&D Center, Huawei Base
   Bantian, Longgang District



Zhang                  Expires September 2012                [Page 25] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   Shenzhen 518129 P.R.China
   Phone: +86-755-28972912
   Email: zhangfatai@huawei.com


   Guoying Zhang
   China Academy of Telecommunication Research of MII
   11 Yue Tan Nan Jie Beijing, P.R.China
   Phone: +86-10-68094272
   Email: zhangguoying@mail.ritt.com.cn


   Sergio Belotti
   Alcatel-Lucent
   Optics CTO
   Via Trento 30 20059 Vimercate (Milano) Italy
   +39 039 6863033
   Email: sergio.belotti@alcatel-lucent.it


   Daniele Ceccarelli
   Ericsson
   Via A. Negrone 1/A
   Genova - Sestri Ponente
   Italy
   Email: daniele.ceccarelli@ericsson.com


   Khuzema Pithewan
   Infinera Corporation
   169, Java Drive
   Sunnyvale, CA-94089,  USA
   Email: kpithewan@infinera.com


   Yi Lin
   Huawei Technologies
   F3-5-B R&D Center, Huawei Base
   Bantian, Longgang District
   Shenzhen 518129 P.R.China
   Phone: +86-755-28972914


Zhang                  Expires September 2012                [Page 26] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   Email: yi.lin@huawei.com



   Yunbin Xu
   China Academy of Telecommunication Research of MII
   11 Yue Tan Nan Jie Beijing, P.R.China
   Phone: +86-10-68094134
   Email: xuyunbin@mail.ritt.com.cn


   Pietro Grandi
   Alcatel-Lucent
   Optics CTO
   Via Trento 30 20059 Vimercate (Milano) Italy
   +39 039 6864930
   Email: pietro_vittorio.grandi@alcatel-lucent.it


   Diego Caviglia
   Ericsson
   Via A. Negrone 1/A
   Genova - Sestri Ponente
   Italy
   Email: diego.caviglia@ericsson.com


   Rajan Rao
   Infinera Corporation
   169, Java Drive
   Sunnyvale, CA-94089
   USA
   Email: rrao@infinera.com


   John E Drake
   Juniper
   Email: jdrake@juniper.net


   Igor Bryskin


Zhang                  Expires September 2012                [Page 27] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   Adva Optical
   EMail: IBryskin@advaoptical.com


15. Acknowledgment 

   The authors would like to thank Lou Berger and Deborah Brungard for 
   their useful comments to the document. 

    

Intellectual Property 
 
   The IETF Trust takes no position regarding the validity or scope of   
   any Intellectual Property Rights or other rights that might be   
   claimed to pertain to the implementation or use of the technology   
   described in any IETF Document or the extent to which any license   
   under such rights might or might not be available; nor does it   
   represent that it has made any independent effort to identify any   
   such rights. 

   Copies of Intellectual Property disclosures made to the IETF   
   Secretariat and any assurances of licenses to be made available, or   
   the result of an attempt made to obtain a general license or   
   permission for the use of such proprietary rights by implementers or   
   users of this specification can be obtained from the IETF on-line IPR   
   repository at http://www.ietf.org/ipr 

   The IETF invites any interested party to bring to its attention any   
   copyrights, patents or patent applications, or other proprietary   
   rights that may cover technology that may be required to implement   
   any standard or specification contained in an IETF Document. Please   
   address the information to the IETF at ietf-ipr@ietf.org. 

   The definitive version of an IETF Document is that published by, or   
   under the auspices of, the IETF. Versions of IETF Documents that are   
   published by third parties, including those that are translated into   
   other languages, should not be considered to be definitive versions   
   of IETF Documents. The definitive version of these Legal Provisions   
   is that published by, or under the auspices of, the IETF. Versions of   
   these Legal Provisions that are published by third parties, including   
   those that are translated into other languages, should not be   
   considered to be definitive versions of these Legal Provisions. 

   For the avoidance of doubt, each Contributor to the IETF Standards   
   Process licenses each Contribution that he or she makes as part of   
 
 
Zhang                  Expires September 2012                [Page 28] 

draft-ietf-ccamp-gmpls-signaling-g709v3-02.txt              March 2012 


   the IETF Standards Process to the IETF Trust pursuant to the   
   provisions of RFC 5378. No language to the contrary, or terms,   
   conditions or rights that differ from or are inconsistent with the   
   rights and licenses granted under RFC 5378, shall have any effect and   
   shall be null and void, whether published or posted by such   
   Contributor, or included with or in such Contribution. 

 
Disclaimer of Validity 
 
   All IETF Documents and the information contained therein are provided   
   on an "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE   
   REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE   
   IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL   
   WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY   
   WARRANTY THAT THE USE OF THE INFORMATION THEREIN WILL NOT INFRINGE   
   ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS   
   FOR A PARTICULAR PURPOSE. 

 
Copyright Notice 
 
   Copyright (c) 2010 IETF Trust and the persons identified as the 
   document authors.  All rights reserved. 

   This document is subject to BCP 78 and the IETF Trust's Legal 
   Provisions Relating to IETF Documents 
   (http://trustee.ietf.org/license-info) in effect on the date of 
   publication of this document.  Please review these documents 
   carefully, as they describe your rights and restrictions with respect 
   to this document.  Code Components extracted from this document must 
   include Simplified BSD License text as described in Section 4.e of 
   the Trust Legal Provisions and are provided without warranty as 
   described in the Simplified BSD License. 












 
 
Zhang                  Expires September 2012                [Page 29] 

